test/good/unused-optional.cfg.dot
digraph "unused-optional" {
    node [shape=box];
    subgraph "cluster_f" {
        label="f";
        "f_148" [label="return 42",style=filled,fillcolor="#66A7DB"];
    }
    subgraph "cluster_fOpt" {
        label="fOpt";
        "fOpt_149" [label="return null",style=filled,fillcolor="#66A7DB"];
    }
    subgraph "cluster_use" {
        label="use";
    }
    subgraph "cluster_C__receive_internal_simple_1713" {
        label="C__receive_internal_simple_1713";
        "C__receive_internal_simple_1713_150" [label="let _a: Int? = m.field"];
        "C__receive_internal_simple_1713_151" [label="self._f4 = m.field",style=filled,fillcolor="#66A7DB"];
        "C__receive_internal_simple_1713_150" -> "C__receive_internal_simple_1713_151";
    }
    subgraph "cluster_C__receive_internal_comment_1720_whatever" {
        label="C__receive_internal_comment_1720_whatever";
        "C__receive_internal_comment_1720_whatever_153" [label="let _a: Int? = 12",style=filled,fillcolor="#66A7DB"];
    }
    subgraph "cluster_C__test" {
        label="C__test";
        "C__test_154" [label="let _a1: Int? = f()"];
        "C__test_155" [label="let _a2: Int? = fOpt()"];
        "C__test_157" [label="let _a3: Int? = self.m()"];
        "C__test_159" [label="let _a4: Int? = self.mOpt()"];
        "C__test_161" [label="let _a5: Int? = 12"];
        "C__test_163" [label="let _a6: Int? = 12"];
        "C__test_165" [label="!!_a6"];
        "C__test_167" [label="let _a7: Int? = 12"];
        "C__test_169" [label="if (_a7 == null)"];
        "C__test_171" [label="let _a8: Int? = 12"];
        "C__test_173" [label="if (null == _a8)"];
        "C__test_175" [label="let _a9: Int? = 12"];
        "C__test_177" [label="use(_a9)"];
        "C__test_179" [label="let _a10: Int = !!self._f1"];
        "C__test_181" [label="use(self._f2)"];
        "C__test_183" [label="if (self._f3 == null)",style=filled,fillcolor="#66A7DB"];
        "C__test_154" -> "C__test_155";
        "C__test_155" -> "C__test_157";
        "C__test_157" -> "C__test_159";
        "C__test_159" -> "C__test_161";
        "C__test_161" -> "C__test_163";
        "C__test_163" -> "C__test_165";
        "C__test_165" -> "C__test_167";
        "C__test_167" -> "C__test_169";
        "C__test_169" -> "C__test_171";
        "C__test_171" -> "C__test_173";
        "C__test_173" -> "C__test_175";
        "C__test_175" -> "C__test_177";
        "C__test_177" -> "C__test_179";
        "C__test_179" -> "C__test_181";
        "C__test_181" -> "C__test_183";
    }
    subgraph "cluster_C__m" {
        label="C__m";
        "C__m_185" [label="return 42",style=filled,fillcolor="#66A7DB"];
    }
    subgraph "cluster_C__mOpt" {
        label="C__mOpt";
        "C__mOpt_186" [label="return null",style=filled,fillcolor="#66A7DB"];
    }
}
